Model: "model2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 20, 20)]     0                                            
__________________________________________________________________________________________________
CONV_1 (Conv1D)                 (None, 16, 10)       1010        input_1[0][0]                    
__________________________________________________________________________________________________
CONV_2 (Conv1D)                 (None, 12, 10)       510         CONV_1[0][0]                     
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 12, 10)       40          CONV_2[0][0]                     
__________________________________________________________________________________________________
dropout (Dropout)               (None, 12, 10)       0           batch_normalization[0][0]        
__________________________________________________________________________________________________
MAXPOOL_2 (MaxPooling1D)        (None, 6, 10)        0           dropout[0][0]                    
__________________________________________________________________________________________________
CONV_3 (Conv1D)                 (None, 2, 10)        510         MAXPOOL_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 2, 10)        40          CONV_3[0][0]                     
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 2, 10)        0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
flatten (Flatten)               (None, 20)           0           dropout_1[0][0]                  
__________________________________________________________________________________________________
DENSE_SOFTMAX_0 (Dense)         (None, 10)           210         flatten[0][0]                    
__________________________________________________________________________________________________
DENSE_SOFTMAX_1 (Dense)         (None, 10)           210         flatten[0][0]                    
__________________________________________________________________________________________________
DENSE_SOFTMAX_2 (Dense)         (None, 10)           210         flatten[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 10)        0           DENSE_SOFTMAX_0[0][0]            
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 1, 10)        0           DENSE_SOFTMAX_1[0][0]            
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 1, 10)        0           DENSE_SOFTMAX_2[0][0]            
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 3, 10)        0           reshape[0][0]                    
                                                                 reshape_1[0][0]                  
                                                                 reshape_2[0][0]                  
==================================================================================================
Total params: 2,740
Trainable params: 2,700
Non-trainable params: 40

Training time = 92.5s
