Model: "model3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 20, 20)]     0                                            
__________________________________________________________________________________________________
CONV_1 (Conv1D)                 (None, 16, 10)       1010        input_1[0][0]                    
__________________________________________________________________________________________________
MAXPOOL_1 (MaxPooling1D)        (None, 8, 10)        0           CONV_1[0][0]                     
__________________________________________________________________________________________________
flatten (Flatten)               (None, 80)           0           MAXPOOL_1[0][0]                  
__________________________________________________________________________________________________
DENSE_1 (Dense)                 (None, 80)           6480        flatten[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 80)           320         DENSE_1[0][0]                    
__________________________________________________________________________________________________
dropout (Dropout)               (None, 80)           0           batch_normalization[0][0]        
__________________________________________________________________________________________________
DENSE_2 (Dense)                 (None, 80)           6480        dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 80)           320         DENSE_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 80)           0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
DENSE_SOFTMAX_0 (Dense)         (None, 10)           810         dropout_1[0][0]                  
__________________________________________________________________________________________________
DENSE_SOFTMAX_1 (Dense)         (None, 10)           810         dropout_1[0][0]                  
__________________________________________________________________________________________________
DENSE_SOFTMAX_2 (Dense)         (None, 10)           810         dropout_1[0][0]                  
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 10)        0           DENSE_SOFTMAX_0[0][0]            
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 1, 10)        0           DENSE_SOFTMAX_1[0][0]            
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 1, 10)        0           DENSE_SOFTMAX_2[0][0]            
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 3, 10)        0           reshape[0][0]                    
                                                                 reshape_1[0][0]                  
                                                                 reshape_2[0][0]                  
==================================================================================================
Total params: 17,040
Trainable params: 16,720
Non-trainable params: 320

Training time = 228.3s
